---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.AreaTagLineCannotBeInDesignOption
source: html/2cc621e8-ae93-a3d9-5fec-592e2a900fc6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.AreaTagLineCannotBeInDesignOption Property

Areas and Area Boundaries are not allowed in Design Options. Make an Area Scheme and an Area Plan for this Option then draw all Areas and Area Boundaries in that view.

## Syntax (C#)
```csharp
public static FailureDefinitionId AreaTagLineCannotBeInDesignOption { get; }
```